using Microsoft.EntityFrameworkCore;
using Microsoft.EntityFrameworkCore.Storage;

namespace MyMovieApp.Models
{
    public class FilmContext : DbContext
    {
        public DbSet<Film> Films { get; set; }

        public FilmContext(DbContextOptions<FilmContext> options)
            : base(options) 
        {
            if (Database.EnsureCreated()) {
                Films?.Add(new Film
                {
                    Name = "Мовчання ягнят",
                    Year =  1991,
                    Genre = "Драми , Кримінал , Трилери",
                    Director = "Джонатан Демме",
                    Actors = "Джоді Фостер, Лоуренс А. Бонні, Кейсі Леммонс, Лоуренс Т. Ренц, Скот Ґленн, Ентоні Гілд, Ентоні Гопкінс",
                    Description = "Кримінальний детектив «Мовчання ягнят» знятий за однойменним романом американського " +
                    "письменника Томаса Харріса.\r\nНа Середньому Заході США бешкетує серійний маніяк. Він викрадає жінок," +
                    " а після того як вбиває, здирає з них шкіру, за що його прозвали «Буффало Білл». ФБР робить все можливе, " +
                    "щоб зупинити злочинця, проте, їм не вдається знайти ні однієї зачіпки, яка допомогла б вийти на його слід. " +
                    "У світлі ситуації, що склалася, вони вирішують звернутися за допомогою до небезпечного вбивці Ганнібала " +
                    "Лектора, який нині відбуває ув'язнення в одній з психіатричних лікарень. До цієї справи залучають молоду " +
                    "стажерку Кларису Старлінг. Лектор погоджується допомогти, але тільки за однієї умови: дівчина повинна " +
                    "посвятити його в подробиці свого життя. Через брак вибору, Кларисі не залишається нічого іншого, як піти " +
                    "назустріч. Але чи буде виправданий такий ризик?",
                    Image = "/img/img4.jpg"
                });
                Films?.Add(new Film
                {
                    Name = "Зелена миля",
                    Year =  1999,
                    Genre = "Детективи , Драми , Кримінал , Фентезі",
                    Director = "Френк Дарабонт",
                    Actors = "Том Генкс, Девід Морс, Майкл Кларк Дункан, Бонні Хант, Джеймс Кромвелл, Майкл Джитер",
                    Description = "Культова драма «Зелена миля» знята за однойменним романом Стівена Кінга. Головну роль в картині виконав неповторний Том Хенкс. Дії фільму розгортаються в тюрмі «Холодна Гора». Одного разу в блок для засуджених до смертної кари поступає новий в'язень - Джон Коффі, засуджений за вбивство маленьких дівчаток. Коффі привертає увагу начальника цього блоку - Пола Еджкомба. За довгі роки роботи він надивився на різних злочинців, і він трохи розбирається в людях. Пол сумнівається у винності Коффі, адже не дивлячись на його страхітливий вигляд, він наділений наївною добротою і людяністю. Так само з часом з'ясовується, що Джон є володарем дивного дару - здатності зцілювати. Пол розуміє, що така людина ніяк не може бути вбивцею. Але що ж робити, і як допомогти йому? На противагу добру завжди виступає злою. Цього разу воно виступить в образі Персі - молодого тюремника, який обожнює робити життя в'язнів нестерпним.",
                    Image = "/img/img7.jpg"
                });
                Films?.Add(new Film
                {
                    Name = "Недоторканні / 1+1",
                    Year =  2011,
                    Genre = "Комедія , Драми , Біографія",
                    Director = "Олів'є Накаш",
                    Actors = "Ерік Толедано, Франсуа Клюзе, Омар Сі, Анн Ле Ні, Одрі Флеро, Жозефін де Мо",
                    Description = "Культова драма «Зелена миля» знята за однойменним романом Стівена Кінга. Головну роль в картині виконав неповторний Том Хенкс. Дії фільму розгортаються в тюрмі «Холодна Гора». Одного разу в блок для засуджених до смертної кари поступає новий в'язень - Джон Коффі, засуджений за вбивство маленьких дівчаток. Коффі привертає увагу начальника цього блоку - Пола Еджкомба. За довгі роки роботи він надивився на різних злочинців, і він трохи розбирається в людях. Пол сумнівається у винності Коффі, адже не дивлячись на його страхітливий вигляд, він наділений наївною добротою і людяністю. Так само з часом з'ясовується, що Джон є володарем дивного дару - здатності зцілювати. Пол розуміє, що така людина ніяк не може бути вбивцею. Але що ж робити, і як допомогти йому? На противагу добру завжди виступає злою. Цього разу воно виступить в образі Персі - молодого тюремника, який обожнює робити життя в'язнів нестерпним.",
                    Image = "/img/img2.jpg"
                });
                Films?.Add(new Film
                {
                    Name = "Реквієм по мрії",
                    Year =  2000,
                    Genre = "Драми",
                    Director = "Даррен Аронофскі",
                    Actors = "Еллен Берстін, Джаред Лето, Дженніфер Коннеллі, Марлон Веянс, Крістофер МакДональд, Луїза Лессер",
                    Description = "Прожити життя - просто. Прожити його гідно - складніше. Домогтися серйозних успіхів - дуже важко, для цього потрібно діяти, крокувати до мети. Найпростіше пустити її на самоплив, кинути під укіс і не розмірковувати ні про що. Цим шляхом пішов Гаррі. Наркотична дрімота і прекрасні бачення, щастя, випробуване «під кайфом» замінюють його реальність. Його мати - Сара, щоб не бачити жахів або від власної слабкості, а більше - від прагнення змін, повністю занурилася в світ по той бік телевізійного екрану. Життя її улюблених героїв замінює їй власне ...\r\nАле вони не тільки руйнують себе і своє життя, вони притягують до себе своїх друзів, щоб не тонути одинокими. І вже мало часу залишилося у них до моменту, коли все навколо почне розвалюватися на частини ...",
                    Image = "/img/img8.jpg"
                });
                Films?.Add(new Film
                {
                    Name = "Острів проклятих",
                    Year =  2010,
                    Genre = "Детективи , Драми , Трилери",
                    Director = "Мартін Скорсезе",
                    Actors = "Леонардо ДіКапріо, Марк Руффало, Бен Кінґслі, Макс фон Сюдов, Мішель Вільямс, Емілі Мортімер",
                    Description = "Фільм «Острів проклятих» - психологічний ретро-трилер, знятий за романом письменника і кіносценариста Денніса Ліхейна.\r\n1954 рік. Два бостонських федеральних маршала - досвідчений Тедді Деніелс і нещодавно переведений з Сіетла Чак Аулі - пливуть на острів Шаттер (Острів проклятих). Там знаходиться психлікарня, яка добре охороняється а порядками нагадує в'язницю, куди поміщені божевільні злочинці. Незважаючи на охорону, замки і справну сигналізацію з режимної лікарні примудрилася втекти особливо небезпечна божевільна - Рейчел Соландо, яка в божевіллі втопила своїх дітей.\r\nНа ділі для Деніелса це відрядження - лише привід відвідати каземати для божевільних: на острові міститься піроман Ендрю Леддіс, винуватець загибелі дружини маршала. Знайти його і утікачку Рейчел - ось завдання для Деніелса, проте розслідування чиновників наштовхується на опір двох завідуючих лікарнею і всього медперсоналу. У їхніх діях змученому головним болем федеральному маршалу починає бачитися якась змова, яка заважає розпочатому розслідуванню.",
                    Image = "/img/img1.jpg"
                });
                Films?.Add(new Film
                {
                    Name = "Віднесені вітром",
                    Year =  1939,
                    Genre = "Військові , Драми , Історичні , Романтичні",
                    Director = "Віктор Флемінг",
                    Actors = "Джордж Кьюкор, Сем Вуд, Томас Мітчелл, Барбара О'ніл, Вів'єн Лі, Евелін Кійес",
                    Description = "«Віднесені вітром» - відзначений вісьмома «Оскарами» фільм-легенда, екранізація знаменитого бестселера Маргарет Мітчелл. Історія про кохання, війну, вірність, втрачені ілюзії та прекрасний Південь - квітуча земля, що колись належала шляхетним джентльменам.\r\nВесна 1861 року, напередодні Громадянської війни. Зеленоока кокетка Скарлетт О'Хара, легко розбиває серця молодих кавалерів, збираючись на бал, мріє про грандіозну перемогу. У планах Скарлетт - заручення з витонченим Ешлі Вілксом, на жаль, вже зарученим з кузиною Мелані. Цей бал стане останнім мирним святом старої доброї Джорджії: дуже скоро вихор битв зруйнує колишнє життя, змете неоглядні плантації та змусить забути смішні довоєнні засмучення.\r\nВідважні солдати залишаться на полях великої битви, а бездоганні леді пожертвують всім заради Півдня і коханих. Переживши загибель близьких і дорогих людей, голод, руйнування і принизливу Реконструкцію, Скарлетт залишиться вірною своєму слову, давній мрії й головній цінності - землі свого батька.",
                    Image = "/img/img3.jpg"
                });
                SaveChanges();
            };
        }       
    }
}
